{"id": "imdb_demo_001", "title": "Indie Heartstrings", "rating": 7.5, "sentiment": "Positive", "topic": "Acting", "review": "The leads carry this small town drama with incredibly grounded performances. Even when the plot drifts, their chemistry keeps the emotions honest and earned."}
{"id": "imdb_demo_002", "title": "Effects Overload", "rating": 4.0, "sentiment": "Negative", "topic": "Visual Effects", "review": "Every frame is drenched in CG haze but none of it services the story. It feels like a tech demo stitched into a movie that forgot to include relatable characters."}
{"id": "imdb_demo_003", "title": "Documentary Calm", "rating": 6.0, "sentiment": "Neutral", "topic": "Pacing", "review": "The documentary unfolds at a meditative pace—sometimes soothing, sometimes sleepy. Viewers who enjoy reflective narration will settle in, while thrill seekers may bail early."}
{"id": "imdb_demo_004", "title": "Retro Heist Groove", "rating": 8.2, "sentiment": "Positive", "topic": "Music", "review": "A funky brass-heavy score powers the caper energy from start to finish. The soundtrack practically becomes a character, pushing every switch and disguise into high gear."}
{"id": "imdb_demo_005", "title": "Twist Fatigue", "rating": 3.5, "sentiment": "Disappointed", "topic": "Plot", "review": "Five twist reveals in ninety minutes is about four too many. Instead of suspense we get confusion, and the finale collapses under the weight of its own misdirection."}
{"id": "imdb_demo_006", "title": "Director's Debut", "rating": 7.0, "sentiment": "Touched", "topic": "Directing", "review": "The first-time director favors intimate close ups and natural light, letting the awkward silences linger. It's tender and patient, capturing fragile family bonds with respect."}
{"id": "imdb_demo_007", "title": "Laughs In Translation", "rating": 5.8, "sentiment": "Surprised", "topic": "Other", "review": "Jokes land in bursts, especially when the bilingual cast leans into code switching. It is messy yet charming, and I was surprised by how much sincerity sneaks in."}
{"id": "imdb_demo_008", "title": "Midnight Creature Feature", "rating": 6.7, "sentiment": "Positive", "topic": "Visual Effects", "review": "Practical creature suits paired with grainy lighting give the horror sequences retro flair. It's goofy but delightful, like a VHS tape you would pass around in college."}
{"id": "imdb_demo_009", "title": "Runway Romance", "rating": 5.0, "sentiment": "Neutral", "topic": "Acting", "review": "Two charismatic stars strut through an airy fashion-world romcom. Their banter sparkles, even if the script never pushes them past magazine-cover depth."}
{"id": "imdb_demo_010", "title": "Clockwork Siege", "rating": 8.8, "sentiment": "Positive", "topic": "Pacing", "review": "A tight ninety minutes of relentless siege tactics, edited like a ticking stopwatch. Every setback propels the next maneuver, keeping palms sweaty and eyes glued to the screen."}
{"id": "imdb_demo_011", "title": "Winter Monologue", "rating": 6.3, "sentiment": "Neutral", "topic": "Plot", "review": "Minimalist staging turns the entire film into one long confession. It is earnest and wordy, and whether it moves you depends on your tolerance for monologues."}
{"id": "imdb_demo_012", "title": "Arcade Racer", "rating": 7.9, "sentiment": "Positive", "topic": "Pacing", "review": "From the synthwave soundtrack to the neon reflections on the hood, everything screams momentum. The story is thin, but the pedal never leaves the floor."}
{"id": "imdb_demo_013", "title": "Desert Exodus", "rating": 4.8, "sentiment": "Negative", "topic": "Directing", "review": "Sweeping drone shots cannot hide how inert the character arcs feel. The director chases postcard vistas instead of propulsive stakes."}
{"id": "imdb_demo_014", "title": "Campus Ghost Log", "rating": 6.5, "sentiment": "Surprised", "topic": "Other", "review": "Presented as recovered voice memos, the ghost story is surprisingly intimate. The jump scares are mild, but the diary format hooked me."}
{"id": "imdb_demo_015", "title": "Chef's Tabletop", "rating": 8.0, "sentiment": "Positive", "topic": "Acting", "review": "The ensemble of veteran character actors plates every scene with warmth. Their banter makes the kitchen chaos feel inviting rather than stressful."}
{"id": "imdb_demo_016", "title": "Orbit Drift", "rating": 5.2, "sentiment": "Disappointed", "topic": "Visual Effects", "review": "Despite big claims about practical zero-g rigs, most of the spacewalks look oddly weightless. The concept is bold, the execution unfinished."}
{"id": "imdb_demo_017", "title": "Civic Chorus", "rating": 7.1, "sentiment": "Touched", "topic": "Music", "review": "Community singers bringing life to zoning meetings should not work, yet every harmony feels like a rallying cry. It is sweet without being saccharine."}
{"id": "imdb_demo_018", "title": "Courier of Lies", "rating": 6.9, "sentiment": "Positive", "topic": "Plot", "review": "The thriller leans on classic mistaken-identity tricks but keeps them taut. Each reveal is sensible, giving the final handoff real punch."}
{"id": "imdb_demo_019", "title": "Infinite Detention", "rating": 3.8, "sentiment": "Angry", "topic": "Pacing", "review": "An entire hour passes before anything meaningful happens. The movie feels like being stuck after class for a prank you did not pull."}
{"id": "imdb_demo_020", "title": "Bloom After Burn", "rating": 8.4, "sentiment": "Positive", "topic": "Directing", "review": "Elegant time jumps and tactile production design track a family's recovery after a wildfire. Sensitive direction keeps the hope authentic."}
